testing/ws-payload.xml

<?xml version="1.0" encoding="utf-8"?>
<!--
    xFramium
   
    Copyright 2017 by Moreland Labs LTD (http://www.morelandlabs.com)
   
    Some open source application is free software: you can redistribute 
    it and/or modify it under the terms of the GNU General Public 
    License as published by the Free Software Foundation, either 
    version 3 of the License, or (at your option) any later version.
     
    Some open source application is distributed in the hope that it will 
    be useful, but WITHOUT ANY WARRANTY; without even the implied warranty 
    of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.
     
    You should have received a copy of the GNU General Public License
    along with xFramium.  If not, see <http://www.gnu.org/licenses/>.
   
    @license GPL-3.0+ <http://spdx.org/licenses/GPL-3.0+>
 -->

<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <APR xmlns="http://www.webserviceX.NET/">
      <LoanAmount>{loanAmount}</LoanAmount>
      <ExtraCost>{extraCost}</ExtraCost>
      <InterestRate>{interestRate}</InterestRate>
      <Months>{months}</Months>
    </APR>
  </soap12:Body>
</soap12:Envelope>